app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products"  ORDER BY "products"."id" DESC
---
  def index
    @products = Product.order(id: :desc).all